# Pandas

Dataframes

In [1]:
import pandas as pd

# Crear un DataFrame desde un diccionario
data = {'Nombre': ['Juan', 'María', 'Pedro'],
        'Edad': [25, 30, 35],
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia']}
df = pd.DataFrame(data)
print(df)

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35   Valencia

In [2]:
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35   Valencia

In [3]:
# Acceder a columnas específicas
print(df['Nombre'])

0     Juan
1    María
2    Pedro
Name: Nombre, dtype: object

In [4]:
df['Nombre']

0     Juan
1    María
2    Pedro
Name: Nombre, dtype: object

In [20]:
# Acceder a filas específicas
print(df.loc[0])

Nombre      Juan
Edad          25
Ciudad    Madrid
Name: 0, dtype: object

In [13]:
df.loc[0]

Nombre      Juan
Edad          25
Ciudad    Madrid
Name: 0, dtype: object

In [14]:
data = {'Nombre': ['Juan', 'María', 'Pedro', 'Ana', 'Luis'],
        'Edad': [20, 22, 21, 23, 19],
        'Promedio': [8.5, 7.8, 9.2, 6.9, 8.0]}
alumnos = pd.DataFrame(data)
print(alumnos)

  Nombre  Edad  Promedio
0   Juan    20       8.5
1  María    22       7.8
2  Pedro    21       9.2
3    Ana    23       6.9
4   Luis    19       8.0

In [15]:
alumnos

  Nombre  Edad  Promedio
0   Juan    20       8.5
1  María    22       7.8
2  Pedro    21       9.2
3    Ana    23       6.9
4   Luis    19       8.0

In [23]:
alumnos.iloc[3]

Nombre      Ana
Edad         23
Promedio    6.9
Name: 3, dtype: object

In [26]:
alumnos[['Nombre', 'Promedio']]

  Nombre  Promedio
0   Juan       8.5
1  María       7.8
2  Pedro       9.2
3    Ana       6.9
4   Luis       8.0

In [27]:
alumnos['Nombre', 'Promedio']

KeyError: ('Nombre', 'Promedio')

In [31]:
alumnos[['Nombre', 'Promedio']].iloc[0:1]

  Nombre  Promedio
0   Juan       8.5

In [32]:
listred = ['Nombre', 'Promedio']

alumnos[listred]

  Nombre  Promedio
0   Juan       8.5
1  María       7.8
2  Pedro       9.2
3    Ana       6.9
4   Luis       8.0

In [34]:
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35   Valencia

In [35]:
df[['Nombre', 'Edad']]

  Nombre  Edad
0   Juan    25
1  María    30
2  Pedro    35

Series

In [43]:
# Crear una Serie desde una lista
data = [10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [44]:
# Acceder a elementos específicos
print(s[2])

30

In [45]:
# Realizar operaciones en una Serie
s = s * 2
print(s)

0     20
1     40
2     60
3     80
4    100
dtype: int64

# Ejemplos

In [46]:
#Ejemplo: promedio de temperaturas

temperaturas = pd.Series([25, 30, 28, 32, 27])
print(temperaturas)
media = temperaturas.mean()
print("Media de las temperaturas:", media)

0    25
1    30
2    28
3    32
4    27
dtype: int64
Media de las temperaturas: 28.4

In [47]:
#Ejemplo: crear df y exportarlo a csv
data = {'Nombre': ['Juan', 'María', 'Pedro', 'Ana', 'Luis'],
        'Edad': [20, 22, 21, 23, 19],
        'Promedio': [8.5, 7.8, 9.2, 6.9, 8.0]}
alumnos = pd.DataFrame(data)

alumnos.to_csv('alumnos.csv', index=False)
alumnos.to_excel('alumnos.xlsx', index=False)

In [48]:
# Leer el archivo CSV y mostrar el DataFrame
df_csv = pd.read_csv('alumnos.csv')
df_csv

  Nombre  Edad  Promedio
0   Juan    20       8.5
1  María    22       7.8
2  Pedro    21       9.2
3    Ana    23       6.9
4   Luis    19       8.0

In [49]:
df_excel = pd.read_excel('alumnos.xlsx')
df_excel

  Nombre  Edad  Promedio
0   Juan    20       8.5
1  María    22       7.8
2  Pedro    21       9.2
3    Ana    23       6.9
4   Luis    19       8.0

In [50]:

data = {'Nombre': ['Juan', 'María', 'Pedro', 'Ana', 'Luis'],
        'Edad': [20, 22, None, 23, 19],
        'Promedio': [8.5, 7.8, None, 6.9, 8.0]}
alumnos = pd.DataFrame(data)

In [51]:
alumnos

  Nombre  Edad  Promedio
0   Juan  20.0       8.5
1  María  22.0       7.8
2  Pedro   NaN       NaN
3    Ana  23.0       6.9
4   Luis  19.0       8.0

In [52]:
# Eliminar filas con valores faltantes
alumnos.dropna(inplace=True)

print(alumnos)

  Nombre  Edad  Promedio
0   Juan  20.0       8.5
1  María  22.0       7.8
3    Ana  23.0       6.9
4   Luis  19.0       8.0

In [53]:
# Rellenar valores faltantes de la columna "Promedio" con 0
data = {'Nombre': ['Juan', 'María', 'Pedro', 'Ana', 'Luis'],
        'Edad': [20, 22, None, 23, 19],
        'Promedio': [8.5, 7.8, None, 6.9, 8.0]}
alumnos = pd.DataFrame(data)

alumnos['Promedio'].fillna(0, inplace=True)

print(alumnos)

  Nombre  Edad  Promedio
0   Juan  20.0       8.5
1  María  22.0       7.8
2  Pedro   NaN       0.0
3    Ana  23.0       6.9
4   Luis  19.0       8.0

In [54]:
# Eliminar duplicados
data = {'Nombre': ['Juan', 'María', 'Pedro', 'Ana', 'Luis'],
        'Edad': [20, 22, None, 23, 19],
        'Promedio': [8.5, 7.8, None, 6.9, 8.0]}
alumnos = pd.DataFrame(data)

alumnos.drop_duplicates(inplace=True)

print(alumnos)

  Nombre  Edad  Promedio
0   Juan  20.0       8.5
1  María  22.0       7.8
2  Pedro   NaN       NaN
3    Ana  23.0       6.9
4   Luis  19.0       8.0

In [55]:
data = {'Nombre': ['Juan', 'María', 'Pedro', 'Ana', 'Luis'],
        'Edad': [20, 22, 21, 23, 19],
        'Promedio': [8.5, 7.8, 9.2, 6.9, 8.0]}
alumnos = pd.DataFrame(data)

# Calcula la media de la columna "Edad"
media_edad = alumnos['Edad'].mean()
print("Media de la edad:", media_edad)

# Calcula la desviación estándar de la columna "Promedio"
desviacion_promedio = alumnos['Promedio'].std()
print("Desviación estándar del promedio:", desviacion_promedio)

# Calcula el valor máximo de la columna "Promedio"
max_promedio = alumnos['Promedio'].max()
print("Valor máximo del promedio:", max_promedio)

Media de la edad: 21.0
Desviación estándar del promedio: 0.8526429498916879
Valor máximo del promedio: 9.2

In [56]:
# Crear un DataFrame de ejemplo
data = {'Nombre': ['Juan', 'María', 'Pedro', 'Ana', 'Luis'],
        'Edad': [20, 22, 21, 23, 19],
        'Promedio': [8.5, 7.8, 9.2, 6.9, 8.0]}
df = pd.DataFrame(data)

# Aplicar una expresión lambda para agregar una columna calculando el cuadrado de la edad
df['Edad Cuadrado'] = df['Edad'].apply(lambda x: x ** 2)

# Mostrar el DataFrame resultante
df

  Nombre  Edad  Promedio  Edad Cuadrado
0   Juan    20       8.5            400
1  María    22       7.8            484
2  Pedro    21       9.2            441
3    Ana    23       6.9            529
4   Luis    19       8.0            361

In [57]:
# Crear dos DataFrames de ejemplo
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})

# Concatenar los DataFrames en filas
df_concat = pd.concat([df1, df2], ignore_index=True)

# Mostrar el DataFrame resultante
df_concat

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12

In [58]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [59]:
df2

   A   B
0  7  10
1  8  11
2  9  12

In [60]:
# Crear dos DataFrames de ejemplo
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'C': [7, 8, 9], 'D': [10, 11, 12]})

# Concatenar los DataFrames en columnas
df_concat = pd.concat([df1, df2], axis=1)

# Mostrar el DataFrame resultante
df_concat

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [61]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [62]:
df2

   C   D
0  7  10
1  8  11
2  9  12